; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v4 ?v3)
		(pred_6 ?v2)
		(pred_1 ?v6)
		(pred_5 ?v6)
		(pred_3 ?v2 ?v6)
		(pred_2)
		(pred_4 ?v2))

   (:action op_2
       :parameters  (?v1 ?v5)
       :precondition (and (not-eq ?v1 ?v5) 
                          (pred_1 ?v1) (pred_1 ?v5) (pred_5 ?v1))
       :effect (and  (pred_5 ?v5)
		     (not (pred_5 ?v1))))


   (:action op_1
       :parameters (?v7 ?v8)
       :precondition  (and  (pred_6 ?v7) (pred_1 ?v8)
			    (pred_3 ?v7 ?v8) (pred_5 ?v8) (pred_2))
       :effect (and (pred_4 ?v7)
		    (not (pred_3 ?v7 ?v8)) 
		    (not (pred_2))))

   (:action op_3
       :parameters  (?v7  ?v8)
       :precondition  (and  (pred_6 ?v7) (pred_1 ?v8)
			    (pred_4 ?v7) (pred_5 ?v8))
       :effect (and (pred_3 ?v7 ?v8)
		    (pred_2)
		    (not (pred_4 ?v7)))))

; problem
(define (problem ferry-l4-c3)
(:domain ferry)
(:objects obj_01 obj_03 obj_05 obj_06 
          obj_04 obj_02 obj_07 
)
(:init
(pred_1 obj_01)
(pred_1 obj_03)
(pred_1 obj_05)
(pred_1 obj_06)
(pred_6 obj_04)
(pred_6 obj_02)
(pred_6 obj_07)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_01)
(not-eq obj_01 obj_06)
(not-eq obj_06 obj_01)
(not-eq obj_03 obj_05)
(not-eq obj_05 obj_03)
(not-eq obj_03 obj_06)
(not-eq obj_06 obj_03)
(not-eq obj_05 obj_06)
(not-eq obj_06 obj_05)
(pred_2)
(pred_3 obj_04 obj_01)
(pred_3 obj_02 obj_03)
(pred_3 obj_07 obj_01)
(pred_5 obj_06)
)
(:goal
(and
(pred_3 obj_04 obj_01)
(pred_3 obj_02 obj_06)
(pred_3 obj_07 obj_03)
)
)

(:constraints
  (and
    (sometime-before  (pred_3 obj_02 obj_06) (pred_5 obj_01))
    (sometime-before  (pred_3 obj_07 obj_03) (pred_5 obj_05))
  )
)
)

; plan
1. (op_2 obj_06 obj_03)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_03)
   goals met: 1 of 3
2. (op_1 obj_02 obj_03)
   deleted: (pred_3 obj_02 obj_03) (pred_2)
   added: (pred_4 obj_02)
   goals met: 1 of 3
3. (op_2 obj_03 obj_05)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_05)
   goals met: 1 of 3
4. (op_3 obj_02 obj_05)
   deleted: (pred_4 obj_02)
   added: (pred_3 obj_02 obj_05) (pred_2)
   goals met: 1 of 3
5. (op_2 obj_05 obj_01)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_01)
   goals met: 1 of 3
6. (op_1 obj_07 obj_01)
   deleted: (pred_3 obj_07 obj_01) (pred_2)
   added: (pred_4 obj_07)
   goals met: 1 of 3
7. (op_2 obj_01 obj_03)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_03)
   goals met: 1 of 3
8. (op_3 obj_07 obj_03)
   deleted: (pred_4 obj_07)
   added: (pred_3 obj_07 obj_03) (pred_2)
   goals met: 2 of 3
9. (op_2 obj_03 obj_05)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_05)
   goals met: 2 of 3
10. (op_1 obj_02 obj_05)
   deleted: (pred_3 obj_02 obj_05) (pred_2)
   added: (pred_4 obj_02)
   goals met: 2 of 3
11. (op_2 obj_05 obj_06)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_06)
   goals met: 2 of 3
12. (op_3 obj_02 obj_06)
   deleted: (pred_4 obj_02)
   added: (pred_3 obj_02 obj_06) (pred_2)
   goals met: 3 of 3
